[
    {
        "id": 1,
        "title": "Research Internship at International Institute of Information Technology, Hyderabad",
        "body": "As an intern in the Serious Games Lab of International Institute of Information and Technology, Hyderabad for a duration of 2 months, I worked on a few research projects primarily addressing to the physiotherapy needs and experience of paralyzed patients. One of the projects aims at enhancing the physiotherapy session experience of post stroke patients. Building interactive and engaging games by integrating Xbox's Kinect with Unity game engine, I have developed a game where the player's movements of upper limb and lower limb are tracked by the Kinect and it is replicated by appropriate scaling onto the game character. As a part of a different project with the same lab, I have developed a game which requires a single input from the player, a space-bar press at the right time. The main aim of this game was to capture the EEG signals of the player along with the timestamp when he successfully executed the key press. The time lapse between the signals in the brain and pressing of the keyboard are then compared to see the recovery state of the patient. In addition to these, I also worked in the Motion Capture studio at IIIT. We recorded clips as per the requirement and exported them to be used in games and movies.",
        "img": "./assets/images/iiit-research.png"
    }, 
    {
        "id": 2,
        "title": "Construction Strategies and Measuring Magnitude of Optical Illusion from an empirically derived formula",
        "body": "The tourists to Taj-Mahal come across an optical illusion in which the size of the Taj, as seen through it’s arch, decreases as one approaches the arch. This phenomenon is observed only beyond the arch and not after one crosses the arch. Not much study has been performed regarding this illusion. After a good search, I’ve found a similar phenomenon even in my locality. Taking help of the two, I’ve designed a 2-D apparatus analogous to the two cases, in order to make my further experimentation handy. The apparatus comprises of two congruent sectors of two concentric circles. These were placed in various orientations in an imaginary co-ordinate system, with smaller arcs of both pieces facing the same direction, in such a way so as to resemble the arch and monument. Several observations such as the sector appearing larger, viewer’s angle of elevation, angle between the two sectors were noted for different orientations. The nature and degree of illusion experienced in each case was also noted. From all the obtained experimental data, an empirical formula was derived to measure the magnitude of optical illusion for any given configuration. This was further analyzed and tested by applying it in the two cases mentioned earlier. Relations between the individual parameters were proved diagrammatically. Based on these relations and the obtained formula, construction strategies have been designed in order to facilitate a similar phenomenon in any of the future constructions. This project done by me has been appreciated on various platforms by various scientists, researchers and professors. My project has been selected for the finals of IRIS National Science Fair, one among hundred finalists.",
        "img": "./assets/images/iris-research.png"
    }
]